create table hk_immigration_sum_monthly
(
    年月       DATE,
    hk机场入境 INTEGER,
    cn机场入境 INTEGER,
    gl机场入境 INTEGER,
    机场入境   INTEGER,
    总计入境   INTEGER,
    hk机场出境 INTEGER,
    cn机场出境 INTEGER,
    gl机场出境 INTEGER,
    机场出境   INTEGER,
    总计出境   INTEGER,
    总计出入境 INTEGER
);

INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-04-01', 432641, 130516, 258142, 821299, 5543625, 450243, 122227, 258486, 830956, 5673419, 11217044);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-05-01', 261508, 147907, 193276, 602691, 4255019, 255152, 123280, 210477, 588909, 4288004, 8543023);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-06-01', 203049, 75521, 112391, 390961, 2642842, 204650, 66321, 126245, 397216, 2865000, 5507842);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-07-01', 59866, 12074, 16728, 88668, 677608, 37017, 11836, 22266, 71119, 370907, 1048515);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-09-01', 213686, 52755, 89541, 355982, 2623991, 220065, 73385, 99846, 393296, 2662078, 5286069);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-10-01', 221467, 127157, 89846, 438470, 2344996, 222874, 86288, 75771, 384933, 2365587, 4710583);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2019-12-01', 505716, 63301, 194140, 763157, 4443354, 530446, 49662, 155089, 735197, 4543343, 8986697);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-01-01', 361206, 76717, 72676, 510599, 1917024, 385384, 59242, 94225, 538851, 1643383, 3560407);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-02-01', 541385, 54079, 69367, 664831, 1145728, 426138, 32818, 83811, 542767, 925299, 2071027);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-03-01', 208086, 19178, 36004, 263268, 461183, 100566, 4904, 22714, 128184, 371895, 833078);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-04-01', 17418, 103, 633, 18154, 37541, 8435, 411, 1507, 10353, 22143, 59684);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-05-01', 21859, 183, 1135, 23177, 64322, 7892, 194, 1646, 9732, 20555, 84877);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-06-01', 26654, 173, 1559, 28386, 81837, 13971, 319, 2537, 16827, 54687, 136524);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-07-01', 26023, 184, 1561, 27768, 61580, 31253, 1188, 2778, 35219, 101323, 162903);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-08-01', 19921, 155, 793, 20869, 42221, 42136, 865, 2514, 45515, 79619, 121840);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-09-01', 28289, 192, 927, 29408, 80378, 39643, 544, 1491, 41678, 63023, 143401);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-10-01', 22984, 146, 1012, 24142, 58480, 25748, 555, 1407, 27710, 53854, 112334);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-11-01', 24916, 139, 915, 25970, 55645, 23133, 393, 1478, 25004, 56108, 111753);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2020-12-01', 21506, 104, 811, 22421, 50339, 34059, 558, 1395, 36012, 109014, 159353);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-01-01', 16292, 114, 518, 16924, 51995, 27182, 484, 1214, 28880, 81994, 133989);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-02-01', 12804, 93, 423, 13320, 70909, 16952, 234, 975, 18161, 38891, 109800);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-03-01', 12938, 126, 518, 13582, 61786, 20619, 378, 863, 21860, 49005, 110791);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-04-01', 11761, 110, 517, 12388, 53621, 21413, 259, 964, 22636, 52747, 106368);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-05-01', 14930, 154, 563, 15647, 53092, 25239, 267, 1104, 26610, 61042, 114134);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-06-01', 21663, 565, 390, 22618, 55148, 35352, 639, 837, 36828, 64766, 119914);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-07-01', 20397, 525, 444, 21366, 67119, 49832, 753, 698, 51283, 105697, 172816);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-08-01', 29916, 386, 875, 31177, 136822, 46973, 523, 812, 48308, 103379, 240201);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-09-01', 23575, 296, 964, 24835, 92398, 44049, 766, 1073, 45888, 94738, 187136);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-10-01', 23552, 272, 1196, 25020, 86282, 31462, 954, 1107, 33523, 89131, 175413);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-11-01', 23584, 596, 1290, 25470, 84129, 29680, 837, 1344, 31861, 85801, 169930);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2021-12-01', 25892, 401, 976, 27269, 121884, 41999, 703, 1623, 44325, 138763, 260647);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-01-01', 14982, 441, 452, 15875, 63141, 33826, 881, 1434, 36141, 78393, 141534);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-02-01', 9872, 107, 340, 10319, 22681, 52946, 2101, 932, 55979, 94035, 116716);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-03-01', 8570, 81, 272, 8923, 16676, 64514, 1494, 1059, 67067, 86763, 103439);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-04-01', 41891, 276, 463, 42630, 69882, 51847, 823, 903, 53573, 70663, 140545);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-05-01', 58263, 8831, 3257, 70351, 113925, 60485, 2876, 1610, 64971, 90847, 204772);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-06-01', 68023, 30222, 4435, 102680, 136994, 93602, 10217, 3400, 107219, 143457, 280451);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-07-01', 85619, 33608, 5251, 124478, 171843, 102411, 20371, 5606, 128388, 194240, 366083);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-08-01', 125943, 38217, 9011, 173171, 266755, 107377, 27306, 7800, 142483, 222427, 489182);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-09-01', 102753, 41005, 12446, 156204, 224481, 123701, 36342, 11106, 171149, 229266, 453747);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-10-01', 192293, 38339, 29994, 260626, 318935, 212652, 32565, 25221, 270438, 319514, 638449);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-11-01', 305157, 48415, 51545, 405117, 460920, 308506, 42562, 47375, 398443, 443583, 904503);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2022-12-01', 447483, 55497, 84537, 587517, 662515, 554400, 52268, 73107, 679775, 760221, 1422736);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-01-01', 622988, 94966, 114905, 832859, 2154791, 565140, 78327, 130017, 773484, 2155736, 4310527);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-02-01', 459105, 138918, 203153, 801176, 5101482, 438646, 122383, 171973, 733002, 5016366, 10117848);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-03-01', 571233, 210043, 282699, 1063975, 7606213, 634954, 178360, 275035, 1088349, 7769535, 15375748);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-04-01', 784614, 204703, 331594, 1320911, 9187953, 764559, 188141, 310749, 1263449, 9117305, 18305258);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-05-01', 695395, 248522, 314302, 1258219, 8721589, 710142, 205913, 319772, 1235827, 8702775, 17424364);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-06-01', 759782, 243381, 361941, 1365104, 8584047, 804649, 190689, 338728, 1334066, 8744164, 17328211);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-07-01', 902681, 281614, 345442, 1529737, 10325620, 966464, 260964, 350666, 1578094, 10362934, 20688554);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-08-01', 1050955, 307229, 343772, 1701956, 11531552, 919672, 295172, 344870, 1559714, 11311493, 22843045);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-09-01', 698140, 217070, 364820, 1280030, 8646555, 733124, 243531, 352970, 1329625, 8953457, 17600012);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-10-01', 857608, 281914, 457299, 1596821, 10897274, 800899, 212134, 418109, 1431142, 10502218, 21399492);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-11-01', 816750, 212840, 519947, 1549537, 10729072, 808293, 184050, 515944, 1508287, 10721856, 21450928);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2023-12-01', 953800, 250977, 586844, 1791621, 12349501, 1053456, 204887, 535567, 1793910, 12595214, 24944715);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2024-01-01', 865349, 296567, 500486, 1662402, 11744807, 722218, 289184, 564706, 1576108, 11399985, 23144792);
INSERT INTO hk_immigration_sum_monthly (年月, hk机场入境, cn机场入境, gl机场入境, 机场入境, 总计入境, hk机场出境, cn机场出境, gl机场出境, 机场出境, 总计出境, 总计出入境) VALUES ('2024-02-01', 581430, 288477, 242716, 1112623, 8054034, 623438, 249295, 244832, 1117565, 8209728, 16263762);
